tap "asmvik/formulae"
tap "felixkratz/formulae"
tap "koekeishiya/formulae"
tap "libsql/sqld"
tap "nikitabobko/tap"
tap "tursodatabase/tap"
brew "bat"
brew "chafa"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "ghostscript"
brew "git"
brew "go"
brew "imagemagick"
brew "jp2a"
brew "jq"
brew "lapack"
brew "lazygit"
brew "lizard", link: false
brew "make"
brew "openjdk"
brew "maven"
brew "node"
brew "mermaid-cli"
brew "minikube"
brew "neovim"
brew "openblas"
brew "numpy"
brew "ripgrep"
brew "opencode"
brew "openjdk@11"
brew "openjdk@17"
brew "pandoc"
brew "pipx"
brew "postgresql@15", restart_service: :changed
brew "python-matplotlib"
brew "python-setuptools"
brew "starship"
brew "staticcheck"
brew "stow"
brew "tectonic"
brew "tmux"
brew "uv"
brew "asmvik/formulae/skhd"
brew "felixkratz/formulae/borders"
brew "koekeishiya/formulae/yabai"
brew "tursodatabase/tap/turso"
cask "nikitabobko/tap/aerospace"
cask "font-geist-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-source-code-pro"
cask "font-symbols-only-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "inkscape"
cask "kitty"
cask "mactex"
cask "obsidian"
cask "skim"
cask "visual-studio-code"
cask "zen"
vscode "brobeson.vscode-lizard"
vscode "esbenp.prettier-vscode"
vscode "franneck94.c-cpp-runner"
vscode "golang.go"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "redhat.java"
vscode "swiftlang.swift-vscode"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
go "github.com/rishprsi/BlogAggregator"
go "github.com/bootdotdev/bootdev"
go "github.com/pressly/goose/v3/cmd/goose"
go "github.com/securego/gosec/v2/cmd/gosec"
go "www.github.com/rishprsi/hellogo"
go "github.com/sqlc-dev/sqlc/cmd/sqlc"
go "honnef.co/go/tools/cmd/staticcheck"
